Revit 2027 API
RebarBarType.MaximumBendRadius Property
 Defines maximum bend radius of rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaximumBendRadius { get; set; }
Public Property MaximumBendRadius As Double
	Get
	Set
public:
property double MaximumBendRadius {
	double get ();
	void set (double value);
}
member MaximumBendRadius : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for maximumBendRadius is not a number
ArgumentOutOfRangeException |  When setting this property: maximumBendRadius must be greater than 0 and no more than 30000.
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace